20250105005315-area_backend.org
:PROPERTIES:
:ID:       1067cbc4-bdfd-4167-98c4-b4d9f28b0560
:END:
#+title: Area-Backend
#+category: AREA #+filetags: :programming:backend:

* Backend
** Objectives
- Learn Backend with Python and Go
- Find a Job
** Resources
*** Online Courses
- **Boot-Dev** https://www.boot.dev/tracks/backend
*** Literature
**** Books
***** Main Books
****** [[id:cdd2475f-a203-40ee-9bc7-809bb125cf3e][Book - Automate The Boring Stuff With Python]] 
****** TOREAD "Pro Git" por Scott Chacon y Ben Straub
****** TOREAD "Python Crash Course" por Eric Matthes
****** TOREAD "Clean Code" por Robert C. Martin
****** TOREAD "Designing Data-Intensive Applications" por Martin Kleppmann
****** TOREAD "Programming in Go: Creating Applications for the 21st Century" por Mark Summerfield
****** TOREAD "The Pragmatic Programmer" por Andrew Hunt y David Thomas
****** TOREAD "Learning SQL" por Alan Beaulieu
****** TOREAD "Docker Deep Dive" por Nigel Poulton
***** Extras
****** TOREAD "The Complete Software Developer's Career Guide" de John Sonmez
****** TOREAD "Writing Great Specifications" de Robert C. Martin
****** TOREAD "Documenting Software Architectures: Views and Beyond" de Paul Clements
****** TOREAD "API Documentation: Best Practices" (artículo online)
****** TOREAD "Scrum: The Art of Doing Twice the Work in Half the Time" de Jeff Sutherland 
** Now Plan
*** TODO Read [[id:cdd2475f-a203-40ee-9bc7-809bb125cf3e][Book - Automate The Boring Stuff With Python]] 
I will solve every exercise in python with tkinter and C++ with Qt, the goal is to learn GUI with pyhton and learn C++ and GUI.
** Plan
*** TODO Learn to code in Python (10h ~ 3 days) [35%]
**** DONE Introduction
CLOSED: [2025-01-05 dom 07:48]
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-01-05 dom 07:48]
:END:
Learn about the Python programming language and why it's so ubiquitous
**** DONE Variables
CLOSED: [2025-01-05 dom 07:48]
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-01-05 dom 07:48]
:END:
Learn how variables are declared and used in Python
**** DONE Functions
CLOSED: [2025-01-05 dom 07:48]
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-01-05 dom 07:48]
:END:
Learn how to declare and call functions
**** DONE Scope
CLOSED: [2025-01-05 dom 07:49]
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-01-05 dom 07:49]
:END:
Learn how Python scopes variables in different contexts
**** TODO Testing and Debugging
Learn how unit tests and good debugging practices will help you write better code
**** TODO Computing
Learn the basics of how computers work internally
**** TODO Comparisons
Learn how to compare different values and make logical decisions in a program
**** TODO Loops
Master the art of reusing code
**** TODO Lists
Learn the most basic and powerful data structure in all of coding
**** DONE Dictionaries
CLOSED: [2025-01-15 mié 10:53]
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-01-15 mié 10:53]
:END:
Learn about Python's built-in support for complex structures
**** TODO Sets
Master another basic data structure of the Python language
**** TODO Errors
Learn how to deal with unexpected data and inputs in a Python program
**** TODO Challenges
Put your skills to work by squashing some challenging problems
**** TODO Quiz
Quiz yourself on some of the important-to-know facts about the Python language
*** TODO Learn Shells and Terminals (10h ~ 2 dias) [0%]
**** TODO Terminals and Shells
Learn how to use a CLI, and why text-based interfaces are so powerful.
**** TODO Filesystems
Learn how to navigate a filesystem, and how to create, move, and delete files and directories.
**** TODO Permissions
Learn how to use permissions to control access to files and directories.
**** TODO Programs
Learn the ins and outs of executing programs and how to connect them in modular pipelines.
**** TODO Packages
Learn how to use package managers like Homebrew, APT and Webi to install and manage software, and set up your development environment.
*** TODO Learn Git (10h ~ 2 dias) [%]
**** TODO Setup
Install and configure Git on your local machine
**** TODO Repositories
Learn about Git repositories, what they are, and how to work with commits
**** TODO Internals
Learn how Git stores data on the files system and the plumbing commands that make it all work
**** TODO Config
Learn how to configure Git and set up your user information
**** TODO Branching
Practice creating and switching between branches
**** TODO Merge
Merge changes from one branch into another and learn how merge commits work
**** TODO Rebase
Learn about the cooler way to integrate changes from one branch into another
**** TODO Reset
Learn how to undo changes with the reset command
**** TODO Remote
Setup a remote repository and learn how to push and pull changes
**** TODO GitHub
Learn how to use Git with GitHub, the most popular Git hosting service
**** TODO Gitignore
Learn about using a .gitignore file to exclude files and directories from being tracked by Git.
*** TODO Build a BookBot in Python (20g ~ 4 dias)
*Me daré tres días para hacer el proyecto y el 4 será para analizarlo y evaluar mi desempeño*
You'll build a real command-line application in Python that does static analysis on text files, or rather, entire novels like "Frankenstein". You'll be guided through the set up of a professional development environment using VS Code, Git, and Github. This is the perfect first Python project for beginners.
*** TODO Learn Object Oriented Programming (15h ~ 3 dias) [%]
**** TODO Classes
Learn about classes and objects, and how they differ from a functional paradigm.
**** TODO Encapsulation
Learn how to write cleaner code by encapsulating data and methods.
**** TODO Abstraction
Abstraction is a powerful tool that will make your code more robust and reusable.
**** TODO Inheritance
The crux of OOP is the ability to inherit data and behaviors from other classes
**** TODO Polymorphism
Polymorphism is one of the best ideas we've had as developers, learn how it works.

*** TODO Build Asteroids using Python and Pygame (20h - 25h ~ 5 dias) [0%]
*4 días para completar el juego y el 5 para evaluarme*
Build a clone of the classic Asteroids game using Pygame and object-oriented programming concepts. This guided project will help you understand how to use Pygame to create a game loop, handle user input, and manage game state. You'll also learn how to use object-oriented programming to create game objects and manage their interactions.

**** TODO Pygame
Setup and install Pygame.
**** TODO Player
Create a Player class and implement movement.
**** TODO Asteroids
Add asteroids for the player to avoid.

