20250105005315-area_backend.org
*** TODO Learn Functional Programming (35h - 40h ~ 6 dias) [%]
Functional programming is back in vogue. There's a reason front-end frameworks like React and Vue are moving toward functional programming, and after this course you'll more than understand its benefits. We'll dive in-depth into all of the foundational concepts of functional programming in a familiar language.

**** TODO What is Functional Programming?
Learn about the difference between OOP and functional styles, and what the real difference is: imperative vs declarative
**** TODO First Class Functions
First class and higher order functions are foundational to everything we do in the functional paradigm
**** TODO Pure Functions
My favorite part of functional programming is the focus on pure functions that are easy to test and reason about
**** TODO Recursion
While not unique to functional programming, recursion is a powerful tool that is used often when trying to avoid imperative code
**** TODO Function Transformations
Learn how to transform functions into other functions to write more abstract and generalized code
**** TODO Closures
Learn about encapsulating state within functions and how to use closures to write more expressive code
**** TODO Currying
Learn to transform a function with multiple parameters into a series of functions with one parameter, and why you might want to do that
**** TODO Decorators
Learn about Python's decorators and how they're essentially syntactic sugar for higher order functions
**** TODO Sum Types
Learn about sum types, a powerful way to represent data that is used in many functional languages
*** TODO Build a Static Site Generator in Python (40h - 50h ~ 10 dias) [%]
Ever wondered how SEO and performance-optimized static site generators like Hugo work? In this guided project you'll build your own from scratch using Python. You'll put a lot of your learnings from Object-Oriented Programming and Functional Programming to use in a tangible web project. This project isn't for the faint of heart, but it's well worth the effort. You'll come away with a deeper understanding of static content management.
**** TODO Static Sites
Learn about what a static site is, and start building the functionality necessary to process and move static HTML and Markdown files.
**** TODO Nodes
Build the core HTML generation logic that will power your static site generator. Use recursion and OOP to build an easily understandable and maintainable system.
**** TODO Inline
Build the inline markdown parsing logic, and the logic to generate inline HTML elements.
**** TODO Blocks
Handle entire blocks of markdown, and generate the HTML nodes that represent them.
**** TODO Website
Put the entire static site generator together, and publish your first website.
*** TODO Learn Algorithms in Python (25h - 35h ~ 7 dias) [0%]

Big-O complexity is arguably the most important concept students learn in a formal computer science degree. This Python course will give you the foundation you need to start your career off on the right foot. After completing this course you'll be comfortable crushing algorithm interview questions and writing performant code.
**** TODO Introduction
Learn about what algorithms are and why they matter
**** TODO Math
Learn the math required to understand Big-O notation, namely exponents, logarithms, and factorials
**** TODO Polynomial Time
Figure out what polynomial time means in the context of algorithms and performant code
**** TODO Sorting Algorithms
Learn how data is sorted on a computer, and how to sort it faster
**** TODO Exponential Time
Understand why exponential time complexity is so dangerous
**** TODO P vs NP
Learn about P and NP
*** Learn Data Structures in Python (30h - 40h ~ 9 dias)
**** Description
If you've had trouble getting past a hard whiteboarding session, this course is for you. You'll build data structures from scratch in Python and improve your problem-solving skills. We'll cover binary trees, linked lists, stacks, graphs and more. This course is a natural next step after the Learn Algorithms course.
**** Chapters
***** Introduction
Learn about data structures and how they play a critical role in algorithms
***** Stacks
Learn about stacks, the original LIFO data structure and build one from scratch
***** Queues
Learn about the FIFO queue data structure and how to implement a simple one from scratch
***** Linked Lists
Understand how linked lists vary from arrays and how to use one to build a faster queue
***** Binary Trees
Learn about binary trees, what they are used for, and implement one from scratch
***** Red Black Trees
Solve the classic balancing problem of traditional binary trees with a red-black algorithm
***** Hashmaps
Build a hashmap from scratch and learn how to use the Python dictionary type effectively
***** Tries
Build all the methods of a trie class, and efficiently search entire documents of text
***** Graphs
Learn about graph structures and how we can use them to quickly solve a wide array of search problems
***** BFS and DFS
Implement and understand the ever-famous breadth first and depth-first search algorithms
*** Build a Maze Solver in Python (15h - 25h ~ 6 dias)
Use Python and Tkinter to build a GUI that solves mazes. You'll be writing code that draws a randomized maze and then systematically solves it. You will use your knowledge of algorithms to automate this fun game! This is a fantastic way to build another real project and solidify your algorithmic skills.
*** Learn Memory Management in C (30h - 50h ~ 8 dias)
**** Description
Memory management is something that every programmer needs to deal with and understand at some point. If you're used to working with languages and tools that handle it for you, this course will teach you how all that works under the hood. You'll even build your own garbage collectors from scratch. This course will teach you the C basics you need for the course, but it's not a course about C, it's about memory.
**** Chapters
***** C Basics
Introduction to the basics of the C programming language
***** Structs
Understand how C structs work and how they're laid out in memory
***** Pointers
You thought pointers were hard? Wrong. Let's figure them out together.
***** Enums
Lean how to use enums (enumerations) in C to create a set of named constants.
***** Unions
Unions in C are not the same as they are in TypeScript. Let's grok C unions.
***** Stack and Heap
Understand the difference between allocating memory on the stack and the heap
***** Advanced Pointers
Let's practice some more advanced pointer concepts - like pointers to pointers
***** Stack Data Structure
Build a stack in C using structs and pointers and understand where the memory is allocated
***** Objects
Implement your own object system for later use in your garbage collection algorithms
***** Refcounting GC
Implement a simple reference counting garbage collector from scratch in C
***** Mark and Sweep GC
Implement a basic mark and sweep garbage collector and understand its tradeoffs with refcounting
*** First Personal Project (40h - 80h ~ 16 dias)
You can't truly become a developer if you can't build your own stuff. Theory and foundations are important, but you also need to be able to fly solo. The purpose of this project is two-fold: a chance to put your skills into practice and to add another project to your portfolio. Well-built personal projects will help you land interviews and jobs, so make sure to put in the effort!
