notes-md/20250105005315-area_backend.md


<a id="org7eaf11a"></a>

### Learn Go for Developers (40h - 70h ~ 14 dias)

Go is one of the most popular languages this year, and Go developers are among the highest paid in the world. Save yourself months of looking through documentation with this comprehensive introduction. You'll practice writing performant, idiomatic Go with these hands-on lessons and challenges.

1.  Chapters

    1.  Variables
    
        Learn the basic syntax for declaring and using variables and why you should use Go in the first place
    
    2.  Conditionals
    
        Use if/else statements to control the flow of your program
    
    3.  Functions
    
        Learn about how functions behave
    
    4.  Structs
    
        Idiomatically model data in Go using structs
    
    5.  Interfaces
    
        Master one of Go's most powerful tools: the interface
    
    6.  Errors
    
        Learn how Go uniquely handles errors
    
    7.  Loops
    
        Practice various algorithms in Go
    
    8.  Slices
    
        Learn about Go's take on ordered lists
    
    9.  Maps
    
        Go has an answer to Python's sets and dictionaries, we call it a map
    
    10. Pointers
    
        Learn about pointers and their pitfalls
    
    11. Packages and Modules
    
        Learn how go projects are organized on your local machine
    
    12. Channels
    
        Master the #1 reason to use Go: its elegance of concurrent programming
    
    13. Mutexes
    
        Continue learning about concurrency with mutexes
    
    14. Generics
    
        Learn how Go approaches polymorphism with generics: a new feature added in 1.18
    
    15. Enums
    
        Go famously doesn't support proper enums, but we'll go over how Go developers solve the same kinds of problems with the tools they have.
    
    16. Quiz
    
        Learn about go-specific design patterns and fun language facts


<a id="org5b5cd65"></a>

### Learn HTTP Clients in Go (20h - 40h ~ 8 dias)

Learn the backbone of the modern web: HTTP network communications. You will be writing real HTTP requests in Go, then parsing and displaying the responses. Each challenge in this course is part of a larger application so that you will understand how HTTP is used in the real world.

1.  Why HTTP?

    Learn about HTTP and how it powers the majority of web communication

2.  JSON

    Learn one of the most popular data formatting notations in the programming world

3.  DNS

    Learn about domain names and how they map human-readable names to physical servers

4.  URIs

    Understand URIs and URLs at a deeper level

5.  Headers

    Practice adding custom headers to HTTP requests and learn about authorization

6.  Methods

    Learn about GET, POST, PUT, and DELETE requests

7.  Paths

    Learn how URL paths and query parameters relate to typical HTTP requests

8.  HTTPS

    Learn how to encrypt HTTP requests and keep them secure

9.  Errors

    Learn how to handle errors in Go

10. cURL

    Use cURL and jq to make HTTP requests from the command line


<a id="org0679486"></a>

### Build a Pokedex in Go (25h - 35h ~ 9 dias)

A REPL, or Read-Eval-Print Loop, is a simple interactive programming environment that takes user input, evaluates it, and returns the result to the user. In this guided project, you'll build a Pokedex-like REPL in Go that uses the PokeAPI to fetch data about Pokemon. It's a great way to put your Go knowledge to the test and learn valuable skills like HTTP networking and data serialization.

1.  Chapters

    1.  REPL
    
        A REPL (Read, Eval, Print Loop) is a simple interactive programming environment that takes user inputs, evaluates them, and returns the results. Learn how to implement one from scratch in Go.
    
    2.  Cache
    
        When making network requests, one of the most common performance optimizations is to cache the results. Implement an in-memory cache for the PokeAPI in Go.
    
    3.  Pokedex
    
        Bring your REPL and cache together to complete your fully functional Pokedex CLI.


<a id="org445d357"></a>

### Learn SQL (20h - 40h ~ 8 dias)

Learn all the basics of Structured Query Language in this comprehensive SQL course. You will build out real database tables and practice querying them in flexible ways right in your browser. Not only will you understand how to use SQL, but you will also learn when you should use it and in what situations. We will cover architectural design patterns and how to use SQL in a production environment.

1.  Chapters

    1.  Introduction
    
        Learn about the basics of SQL and how it came to be
    
    2.  Tables
    
        Create new tables and learn how to structure data efficiently
    
    3.  Constraints
    
        Learn how to keep data accurate and up to date
    
    4.  CRUD
    
        Create, read, update and delete information from a SQL database
    
    5.  Basic Queries
    
        Practice additional clauses and features that SQL offers for more flexible querying
    
    6.  Structuring
    
        Learn how to order and limit the data returned in large query sets
    
    7.  Aggregations
    
        Learn how to run powerful calculations on entire datasets
    
    8.  Subqueries
    
        Practice the advanced technique of nesting queries inside one another
    
    9.  Normalization
    
        Learn how to normalize a database in order to keep it's data consistent and accurate
    
    10. Joins
    
        Practice joining multiple tables together in order to power real world usecases
    
    11. Performance
    
        Learn how to keep databases running fast and efficient in production


<a id="orgd254368"></a>

### Build a Blog Aggregator in Go (40h - 60h ~ 12 dias)

In this guided project you'll practice building a CLI in Go, and you'll use production-ready database tools like PostgreSQL, SQLc, Goose, and psql. This won't just be another CLI utility, but a service that has a long-running service worker that reaches out over the internet to fetch data from remote locations.

1.  Chapters

    1.  Config
    
        Build a system for the CLI tool that allows users to get and set configuration values
    
    2.  Database
    
        Set up Postgres, Goose and SQLC to allow your CLI application to store and retrieve data.
    
    3.  RSS
    
        Build functions that will download and parse data from RSS feeds
    
    4.  Following
    
        Add to the multiplayer features of the project by allowing users to follow other RSS feeds
    
    5.  Aggregate
    
        Turn your CLI into a long running service that continously aggregates posts from RSS feeds.


<a id="org1e29728"></a>

### Learn HTTP Servers in Go (30h - 50h ~ 10 dias)

Learn how to build and HTTP web server from scratch in the Go programming language. You'll build a production ready JSON API using farily minimalistic tools. You'll incorporate middleware, routing, logging, webhooks, authentication, authorization, JWTs, and more. This course is the coup-de-grace for any aspiring backend developer.

1.  Servers

    We'll cover the basics of web servers, and why Go is such a great language for building performant web servers

2.  Routing

    We'll cover the basics of HTTP routing, and how to build a router using Go's standard library

3.  Architecture

    We'll talk about some different web architectures, and how to choose the right one for your project

4.  JSON

    Learn about how to parse and send JSON data from a Go server

5.  Storage

    We'll add a PostgreSQL database and talk about data storage and database migrations

6.  Authentication

    We'll build an authentication system using JWTs from scratch, and compare JWTs to other authentication methods

7.  Authorization

    Learn about how authorization differs from authentication, and how to implement it in your application

8.  Webhooks

    Webhooks are a special kind of HTTP handler that you'll use often in modern web applications. Learn how to use them here

9.  Documentation

    Learn about documentation, why it's important, and learn about some tools that can help you write good documentation
