20250105005315-area_backend.org
*** Learn Docker (15h - 30h ~ 6 dias)
Learn Docker from the ground up by installing, running, creating, and publishing Docker containers. Take your Back-end and DevOps skills to the next level. You will discover how Docker fits into production back-end architectures and complete hands-on projects on your local machine. This course is jam-packed with video explanations and rich text explanations so you'll never get lost.
**** Chapters
***** Install
Get Docker & Docker Hub installed on your local development machine
***** Command Line
Learn how to navigate the Docker command line interface
***** Storage
Practice creating Docker volumes and deploying a blog using the Ghost's official Docker image
***** Networks
Learn how to connect Docker containers by using bridge networks
***** Dockerfiles
Deploy custom applications on Docker by building your own Docker images
***** Publish
Publish your own images up to Docker Hub
*** Learn CI/CD with GitHub Actions, Docker and Go (20h - 40h ~ 8 dias)
You'll build and test a real codebase, and then automate that same build process to deploy an application to the cloud. We'll cover technologies like GitHub Actions, Docker, GCP, Cloud Run, and Turso. If you want to learn how modern tech companies test and ship products, this course is for you.
**** Chapters
***** Continuous Integration
Learn the basics of CI with GitHub Actions
***** Tests
Learn how to write and run tests both locally and with GitHub Actions
***** Formatting
Learn how to run automated code format checks in the cloud
***** Linting
Learn how to run automated code linting checks and learn about the difference between linting and formatting
***** Security
Learn about automatic security checks and how to set them up in a Go project
***** Build
Learn how to build a Go project in the cloud and Dockerize it in GitHub Actions
***** Deploy
Learn how to deploy a Go project to the public internet using GCP and Cloud Run
***** Database
Learn how to connect your public Go service to a managed Turso database. Run migrations in continuous delivery pipelines
*** Capstone Project (50h - 150h ~ 30 dias)
This capstone project should be your resume's pièce de résistance. You're allowed to use any languages or frameworks you want, but you must build it yourself, and it should be remarkable, memorable even. The purpose of this project is two-fold: a chance to put your skills into practice but also to give your resume something that stands out and gets you noticed.
** Log
*** January
- [[id:ff2dbdff-10da-45d3-ab31-93ba51d71ef3][Journal - Backend - 01172025]]
- [[id:6df95a5d-bcf4-4230-bcbd-1045dae9cc68][Journal - Backend - 01182025]]
- [[id:2d3bd225-8625-4eda-a3d8-d771e5f5573a][Journal - Backend - 01192025]]
- [[id:9cdbeaa9-5f0d-4311-9f6b-a9ea67f27e03][Journal - Backend - 01232025]]
- [[id:ef8e73c4-5318-4343-9966-9c260f000cb5][Journal - Backend - 01242025]]

