notes-md/20250105005315-area_backend.md


<a id="org0fc5009"></a>

### Learn Docker (15h - 30h ~ 6 dias)

Learn Docker from the ground up by installing, running, creating, and publishing Docker containers. Take your Back-end and DevOps skills to the next level. You will discover how Docker fits into production back-end architectures and complete hands-on projects on your local machine. This course is jam-packed with video explanations and rich text explanations so you'll never get lost.

1.  Chapters

    1.  Install
    
        Get Docker & Docker Hub installed on your local development machine
    
    2.  Command Line
    
        Learn how to navigate the Docker command line interface
    
    3.  Storage
    
        Practice creating Docker volumes and deploying a blog using the Ghost's official Docker image
    
    4.  Networks
    
        Learn how to connect Docker containers by using bridge networks
    
    5.  Dockerfiles
    
        Deploy custom applications on Docker by building your own Docker images
    
    6.  Publish
    
        Publish your own images up to Docker Hub


<a id="org741d968"></a>

### Learn CI/CD with GitHub Actions, Docker and Go (20h - 40h ~ 8 dias)

You'll build and test a real codebase, and then automate that same build process to deploy an application to the cloud. We'll cover technologies like GitHub Actions, Docker, GCP, Cloud Run, and Turso. If you want to learn how modern tech companies test and ship products, this course is for you.

1.  Chapters

    1.  Continuous Integration
    
        Learn the basics of CI with GitHub Actions
    
    2.  Tests
    
        Learn how to write and run tests both locally and with GitHub Actions
    
    3.  Formatting
    
        Learn how to run automated code format checks in the cloud
    
    4.  Linting
    
        Learn how to run automated code linting checks and learn about the difference between linting and formatting
    
    5.  Security
    
        Learn about automatic security checks and how to set them up in a Go project
    
    6.  Build
    
        Learn how to build a Go project in the cloud and Dockerize it in GitHub Actions
    
    7.  Deploy
    
        Learn how to deploy a Go project to the public internet using GCP and Cloud Run
    
    8.  Database
    
        Learn how to connect your public Go service to a managed Turso database. Run migrations in continuous delivery pipelines


<a id="orgd20aa76"></a>

### Capstone Project (50h - 150h ~ 30 dias)

This capstone project should be your resume's pièce de résistance. You're allowed to use any languages or frameworks you want, but you must build it yourself, and it should be remarkable, memorable even. The purpose of this project is two-fold: a chance to put your skills into practice but also to give your resume something that stands out and gets you noticed.


<a id="org7fecd61"></a>

## Log


<a id="org41b6a32"></a>

### January

-   [Journal - Backend - 01172025](20250117101422-journal_backend_01172025.md)
-   [Journal - Backend - 01182025](20250118005223-journal_backend_01182025.md)
-   [Journal - Backend - 01192025](20250119133757-journal_backend_01192025.md)

